## Aula extra com macetes

In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [7]:
df[['c2','c4']]

    c2  c4
l1   2   4
l2   6   8
l3  10  12
l4  14  16

In [9]:
df[:] #Seleciona tudo

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [10]:
df[1:3] #Ele não seleciona o último (do 1 ao 2 (3-1))

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [13]:
df[1:][['c2','c4']] #Seleção conjunta a partir da linha 1 e as colunas c2 e c4

    c2  c4
l2   6   8
l3  10  12
l4  14  16

In [14]:
df.loc['l2'] #.loc permite selecionar pelo rótulo das linhas

c1    5
c2    6
c3    7
c4    8
Name: l2, dtype: int64

In [15]:
df.loc[['l2','l4']]

    c1  c2  c3  c4
l2   5   6   7   8
l4  13  14  15  16

In [16]:
df.loc['l1','c3'] #Também é possível buscar por linha x coluna

3

In [18]:
df.iloc[0,1] # .iloc ao invés de buscar os rótulos, ele busca pelos índices numéricos

2

In [19]:
df.loc[['l3','l4'],['c1','c4']]

    c1  c4
l3   8  12
l4  13  16

In [20]:
df.iloc[[2,3],[0,3]]

    c1  c4
l3   8  12
l4  13  16